ANGLAS-MECHATRONICS/STM32/OTROS/APRENDIENDO/CURSO UDEMY 2022/stm32f4xx_drivers/Src/GPIO1_rw.c
#include <stm32f446xx.h>
#include <stm32f446xx_gpio.h>

GPIO_handle_t LED;
GPIO_handle_t BUTTON;

uint8_t boton;
uint8_t mem=0;
uint8_t suma=0;

void delay(uint32_t cnt){
	while(cnt)
		cnt--;
}



void GPIO_Setup(){
	LED.pGPIOx = GPIOA;
	LED.GPIO_config.GPIO_Mode = GPIO_MODE_OUT;
	LED.GPIO_config.GPIO_OType = GPIO_OType_PP;
 	LED.GPIO_config.GPIO_Pin = GPIO_PIN_5;
	LED.GPIO_config.GPIO_PuPd = GPIO_PuPd_NONE;
	LED.GPIO_config.GPIO_Speed = GPIO_SPEED_LOW;
	GPIO_Init(&LED);

	BUTTON.pGPIOx = GPIOC;
	BUTTON.GPIO_config.GPIO_Mode = GPIO_MODE_IN;
 	BUTTON.GPIO_config.GPIO_Pin = GPIO_PIN_13;
	BUTTON.GPIO_config.GPIO_PuPd = GPIO_PuPd_NONE;//ya tiene pull-up externo en la nucleo
	BUTTON.GPIO_config.GPIO_Speed = GPIO_SPEED_LOW;
	GPIO_Init(&BUTTON);
}

int main(void){

	GPIO_Setup();

    while(1){

    	boton = GPIO_ReadPin(BUTTON.pGPIOx, GPIO_PIN_13);

    	if(boton == 0 && mem == 0){
    	      mem = 1;}
    	if(boton == 1 && mem == 1){
    	      suma = suma + 1;
    	      mem = 0;}
    	if(suma % 2){
    		GPIO_WritePin(LED.pGPIOx, GPIO_PIN_5, SET);
    	}else{
    		GPIO_WritePin(LED.pGPIOx, GPIO_PIN_5, RESET);
    	}

    }
}

void SPI1_IRQHandler(void){

}
